Update crypto demo to use PATTERN with EVERY
